/*                        -- 渡河蚂蚁电子工作室 --                        */
/*
*   说    明: STC8A8KS4A12 DEMO程序
*   开发平台: STC15W408S     
*   淘宝网店: 
*
//  文件名：main.c                                                              
//  说明：供客户测试模块通信使用程序                                                                  
//  编写人员：Duhemayi                                                                   
//  编写日期：2018-09-16                                                               
//  程序维护：
//  维护记录：
//	版    本: V1.0
//                                                          
// 免责声明：该程序仅用于学习与交流 
// (c) Duhemayi Corporation. All rights reserved.     
******************************************************************************/
#include "delay.h"


/******************************************************************************/
// 函数名称： 
// 输入参数： 
// 输出参数： 
// 函数功能： 
/******************************************************************************/
void Delay100ms()		//@11.0592MHz
{
	unsigned char i, j, k;

	_nop_();
	_nop_();
	i = 13;
	j = 45;
	k = 214;
	do
	{
		do
		{
			while (--k);
		} while (--j);
	} while (--i);
}


/******************************************************************************/
// 函数名称： 
// 输入参数： 
// 输出参数： 
// 函数功能： 
/******************************************************************************/
void Delay1us()		//@11.0592MHz
{
	unsigned char i;

	_nop_();
	_nop_();
	i = 1;
	while (--i);
}

void Delay1ms()		//@11.0592MHz
{
	unsigned char i, j;

	i = 15;
	j = 90;
	do
	{
		while (--j);
	} while (--i);
}

void Delay_nms(unsigned char n)
{
	while(n--)
	{
		Delay1ms();
	 }
}

void Delay140us()		//@11.0592MHz
{
	unsigned char i, j;

	_nop_();
	i = 2;
	j = 0;
	do
	{
		while (--j);
	} while (--i);
}

